---
kind: method
id: M:Autodesk.Revit.DB.ThermalAsset.Equals(Autodesk.Revit.DB.ThermalAsset)
source: html/da718af9-8394-4c28-44aa-8bfde7efdef6.htm
---
# Autodesk.Revit.DB.ThermalAsset.Equals Method

Determines whether this thermal asset is equal to another.

## Syntax (C#)
```csharp
public bool Equals(
	ThermalAsset other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ThermalAsset`) - The thermal asset to compare with this one.

## Returns
True if the given thermal asset is equal to this one, otherwise false.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null